; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-3-5-8-5)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos1-0 pos1-1 pos1-2 pos2-0 pos2-1 pos2-2
    shape0 shape1 shape2 shape3 shape4
    key0 key1 key2 key3 key4 key5 key6 key7
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (shape shape0)
       (shape shape1)
       (shape shape2)
       (shape shape3)
       (shape shape4)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)
       (key key6)
       (key key7)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-1)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (locked pos2-0)
       (locked pos0-0)
       (locked pos0-2)
       (locked pos1-0)
       (locked pos2-1)
       (lock-shape  pos2-0 shape0)
       (lock-shape  pos0-0 shape1)
       (lock-shape  pos0-2 shape2)
       (lock-shape  pos1-0 shape3)
       (lock-shape  pos2-1 shape4)
       (open pos0-1)
       (open pos1-1)
       (open pos1-2)
       (open pos2-2)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape2)
       (key-shape  key3 shape3)
       (key-shape  key4 shape4)
       (key-shape  key5 shape4)
       (key-shape  key6 shape0)
       (key-shape  key7 shape0)
       (at key0 pos0-2)
       (at key1 pos0-2)
       (at key2 pos1-0)
       (at key3 pos2-2)
       (at key4 pos1-2)
       (at key5 pos1-1)
       (at key6 pos0-1)
       (at key7 pos1-1)
       (at-robot pos1-1)
    )

    (:goal (and
       (at key2 pos2-0)
       (at key4 pos0-2)
       (at key7 pos0-2)
    )))

; plan
1. (move pos1-1 pos1-2)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-2)
   goals met: 0 of 3
2. (move pos1-2 pos2-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos2-2)
   goals met: 0 of 3
3. (pickup pos2-2 key3)
   deleted: (at key3 pos2-2) (arm-empty)
   added: (holding key3)
   goals met: 0 of 3
4. (move pos2-2 pos1-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos1-2)
   goals met: 0 of 3
5. (move pos1-2 pos1-1)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-1)
   goals met: 0 of 3
6. (unlock pos1-1 pos1-0 key3 shape3)
   deleted: (locked pos1-0)
   added: (open pos1-0)
   goals met: 0 of 3
7. (pickup-and-loose pos1-1 key7 key3)
   deleted: (holding key3) (at key7 pos1-1)
   added: (holding key7) (at key3 pos1-1)
   goals met: 0 of 3
8. (move pos1-1 pos1-0)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-0)
   goals met: 0 of 3
9. (unlock pos1-0 pos2-0 key7 shape0)
   deleted: (locked pos2-0)
   added: (open pos2-0)
   goals met: 0 of 3
10. (pickup-and-loose pos1-0 key2 key7)
   deleted: (holding key7) (at key2 pos1-0)
   added: (holding key2) (at key7 pos1-0)
   goals met: 0 of 3
11. (move pos1-0 pos1-1)
   deleted: (at-robot pos1-0)
   added: (at-robot pos1-1)
   goals met: 0 of 3
12. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 0 of 3
13. (unlock pos0-1 pos0-2 key2 shape2)
   deleted: (locked pos0-2)
   added: (open pos0-2)
   goals met: 0 of 3
14. (move pos0-1 pos1-1)
   deleted: (at-robot pos0-1)
   added: (at-robot pos1-1)
   goals met: 0 of 3
15. (move pos1-1 pos1-0)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-0)
   goals met: 0 of 3
16. (move pos1-0 pos2-0)
   deleted: (at-robot pos1-0)
   added: (at-robot pos2-0)
   goals met: 0 of 3
17. (putdown pos2-0 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos2-0)
   goals met: 1 of 3
18. (move pos2-0 pos1-0)
   deleted: (at-robot pos2-0)
   added: (at-robot pos1-0)
   goals met: 1 of 3
19. (pickup pos1-0 key7)
   deleted: (at key7 pos1-0) (arm-empty)
   added: (holding key7)
   goals met: 1 of 3
20. (move pos1-0 pos1-1)
   deleted: (at-robot pos1-0)
   added: (at-robot pos1-1)
   goals met: 1 of 3
21. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 1 of 3
22. (move pos0-1 pos0-2)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-2)
   goals met: 1 of 3
23. (pickup-and-loose pos0-2 key0 key7)
   deleted: (holding key7) (at key0 pos0-2)
   added: (holding key0) (at key7 pos0-2)
   goals met: 2 of 3
24. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 2 of 3
25. (pickup-and-loose pos1-2 key4 key0)
   deleted: (holding key0) (at key4 pos1-2)
   added: (holding key4) (at key0 pos1-2)
   goals met: 2 of 3
26. (move pos1-2 pos0-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos0-2)
   goals met: 2 of 3
27. (pickup-and-loose pos0-2 key1 key4)
   deleted: (holding key4) (at key1 pos0-2)
   added: (holding key1) (at key4 pos0-2)
   goals met: 3 of 3
